# 2. Напишите программу для проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
#     ⋀ - and
#     ⋁ - or
#     ¬ - not
#==============================================================================================================
X_pred = int(input('Введите пожалуйста значение X: '))
Y_pred = int(input('Введите пожалуйста значение Y: '))
Z_pred = int(input('Введите пожалуйста значение Z: '))

left = not (X_pred or Y_pred or Z_pred)
right = not X_pred and Y_pred and Z_pred
if left == right:
    print('Утверждение истинно')
else:
    print('Утверждение ложно')
   